; domain
(define (domain blocksworld)
  (:requirements :strips :constraints :negative-preconditions)
  (:predicates (pred_5 ?v2)
               (pred_2 ?v2)
               (pred_1)
               (pred_4 ?v2)
               (pred_3 ?v2 ?v4))

  (:action op_3
    :parameters (?v3)
    :precondition (and (pred_5 ?v3) (pred_2 ?v3) (pred_1))
    :effect (and (pred_4 ?v3) (not (pred_5 ?v3)) (not (pred_2 ?v3)) 
                 (not (pred_1))))

  (:action op_4
    :parameters  (?v3)
    :precondition (pred_4 ?v3)
    :effect (and (pred_5 ?v3) (pred_1) (pred_2 ?v3) 
                 (not (pred_4 ?v3))))

  (:action op_2
    :parameters  (?v3 ?v1)
    :precondition (and (pred_5 ?v1) (pred_4 ?v3))
    :effect (and (pred_1) (pred_5 ?v3) (pred_3 ?v3 ?v1)
                 (not (pred_5 ?v1)) (not (pred_4 ?v3))))

  (:action op_1
    :parameters  (?v3 ?v1)
    :precondition (and (pred_3 ?v3 ?v1) (pred_5 ?v3) (pred_1))
    :effect (and (pred_4 ?v3) (pred_5 ?v1)
                 (not (pred_3 ?v3 ?v1)) (not (pred_5 ?v3)) (not (pred_1)))))

; problem
(define (problem BW-rand-4)
(:domain blocksworld)
(:objects obj_03 obj_01 obj_02 obj_04 )
(:init
(pred_1)
(pred_2 obj_03)
(pred_3 obj_01 obj_04)
(pred_2 obj_02)
(pred_2 obj_04)
(pred_5 obj_03)
(pred_5 obj_01)
(pred_5 obj_02)
)
(:goal
(and
(pred_3 obj_03 obj_04)
(pred_2 obj_01)
(pred_2 obj_02)
(pred_2 obj_04))
)

(:constraints
  (sometime-before (pred_2 obj_01) (pred_3 obj_03 obj_04))
)
)

; plan
1. (op_1 obj_01 obj_04)
   deleted: (pred_3 obj_01 obj_04) (pred_5 obj_01) (pred_1)
   added: (pred_4 obj_01) (pred_5 obj_04)
   goals met: 2 of 4
2. (op_2 obj_01 obj_02)
   deleted: (pred_5 obj_02) (pred_4 obj_01)
   added: (pred_1) (pred_5 obj_01) (pred_3 obj_01 obj_02)
   goals met: 2 of 4
3. (op_3 obj_03)
   deleted: (pred_5 obj_03) (pred_2 obj_03) (pred_1)
   added: (pred_4 obj_03)
   goals met: 2 of 4
4. (op_2 obj_03 obj_04)
   deleted: (pred_5 obj_04) (pred_4 obj_03)
   added: (pred_1) (pred_5 obj_03) (pred_3 obj_03 obj_04)
   goals met: 3 of 4
5. (op_1 obj_01 obj_02)
   deleted: (pred_3 obj_01 obj_02) (pred_5 obj_01) (pred_1)
   added: (pred_4 obj_01) (pred_5 obj_02)
   goals met: 3 of 4
6. (op_4 obj_01)
   deleted: (pred_4 obj_01)
   added: (pred_5 obj_01) (pred_1) (pred_2 obj_01)
   goals met: 4 of 4
